# Factor Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
LoadComponent..::..Factor Property
LoadComponent Class See Also
---
Load component factor.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public double Factor { get; set; }
```

Visual Basic
---
```text
Public Property Factor As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Factor {
	double get ();
	void set (double value);
}
```

# See Also
LoadComponent Class
Autodesk.Revit.DB.Structure Namespace